#===========================================
# 제12강 t 검정
#===========================================
#--- 1. t 검정이란?(p254)
x <- c(74,76,79,80,82,81);x
y <- c(75,76,77,78,76,82);y
t.test(x,y) 
t.test(x,y,var.equal=T) # 분산이 같은 경우
var.test(x,y)

pt(0.82339,10)  # 0.7852573
1-pt(0.82339,10) # 0.2147427
2*(1-pt(0.82339,10)) # 0.4294853

#qt(0.05,10) # -1.812461
#qt(0.95,10) #  1.812461
#pt(1.812461,10) # 0.95

#--- 쌍체비교인 경우(p260)
x <- c(80,73,70,60, 88,84,65,37,91,98,52,78,40,79,59)
y <- c(82,71,95,69,100,71,75,60,95,99,65,83,60,86,62)
t.test(x,y,paired=TRUE)
t.test(y-x)

#--- 설문지(p261) 
s <- read.table("d:/r_sample/survey_h.txt",header=T);s
s <- read.table("d:/r_sample/survey_s.txt",sep="|",header=T);s

var.test(s$wage~s$gender)  # 분산이 같음
t.test(s$wage~s$gender,var.equal=TRUE) # t test


